In [4]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [5]:
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [6]:
df

          W         X         Y         Z
A -1.283227 -0.859481  0.855001 -0.725049
B  0.376838  0.321086 -1.449866  1.248669
C -1.202482 -1.275372  0.636660  0.639819
D -1.521567 -0.025083  0.359819 -0.139716
E  0.835537  0.766352 -1.883364 -2.122937

In [7]:
df['W']

A   -1.283227
B    0.376838
C   -1.202482
D   -1.521567
E    0.835537
Name: W, dtype: float64

In [8]:
df[['W', 'Z']]

          W         Z
A -1.283227 -0.725049
B  0.376838  1.248669
C -1.202482  0.639819
D -1.521567 -0.139716
E  0.835537 -2.122937

In [9]:
df.W

A   -1.283227
B    0.376838
C   -1.202482
D   -1.521567
E    0.835537
Name: W, dtype: float64

In [10]:
type(df['W'])

pandas.core.series.Series

In [11]:
df['new'] = df['W'] + df['Y']

In [12]:
df

          W         X         Y         Z       new
A -1.283227 -0.859481  0.855001 -0.725049 -0.428227
B  0.376838  0.321086 -1.449866  1.248669 -1.073027
C -1.202482 -1.275372  0.636660  0.639819 -0.565822
D -1.521567 -0.025083  0.359819 -0.139716 -1.161748
E  0.835537  0.766352 -1.883364 -2.122937 -1.047827

In [13]:
df.drop('new', axis =1)

          W         X         Y         Z
A -1.283227 -0.859481  0.855001 -0.725049
B  0.376838  0.321086 -1.449866  1.248669
C -1.202482 -1.275372  0.636660  0.639819
D -1.521567 -0.025083  0.359819 -0.139716
E  0.835537  0.766352 -1.883364 -2.122937

In [14]:
df

          W         X         Y         Z       new
A -1.283227 -0.859481  0.855001 -0.725049 -0.428227
B  0.376838  0.321086 -1.449866  1.248669 -1.073027
C -1.202482 -1.275372  0.636660  0.639819 -0.565822
D -1.521567 -0.025083  0.359819 -0.139716 -1.161748
E  0.835537  0.766352 -1.883364 -2.122937 -1.047827

In [15]:
df.drop('new', axis =1,  inplace = True)

In [16]:
df

          W         X         Y         Z
A -1.283227 -0.859481  0.855001 -0.725049
B  0.376838  0.321086 -1.449866  1.248669
C -1.202482 -1.275372  0.636660  0.639819
D -1.521567 -0.025083  0.359819 -0.139716
E  0.835537  0.766352 -1.883364 -2.122937

In [17]:
df.drop('E', axis = 0)

          W         X         Y         Z
A -1.283227 -0.859481  0.855001 -0.725049
B  0.376838  0.321086 -1.449866  1.248669
C -1.202482 -1.275372  0.636660  0.639819
D -1.521567 -0.025083  0.359819 -0.139716

** Selecting Rows**

In [18]:
df.loc['A']

W   -1.283227
X   -0.859481
Y    0.855001
Z   -0.725049
Name: A, dtype: float64

In [19]:
df.iloc[2, ]

W   -1.202482
X   -1.275372
Y    0.636660
Z    0.639819
Name: C, dtype: float64

In [20]:
df.loc['B', 'Y']

-1.449865611698453

In [21]:
df.iloc[1:3, :]

          W         X         Y         Z
B  0.376838  0.321086 -1.449866  1.248669
C -1.202482 -1.275372  0.636660  0.639819

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [22]:
df

          W         X         Y         Z
A -1.283227 -0.859481  0.855001 -0.725049
B  0.376838  0.321086 -1.449866  1.248669
C -1.202482 -1.275372  0.636660  0.639819
D -1.521567 -0.025083  0.359819 -0.139716
E  0.835537  0.766352 -1.883364 -2.122937

In [23]:
df > 0

       W      X      Y      Z
A  False  False   True  False
B   True   True  False   True
C  False  False   True   True
D  False  False   True  False
E   True   True  False  False

In [24]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.855001       NaN
B  0.376838  0.321086       NaN  1.248669
C       NaN       NaN  0.636660  0.639819
D       NaN       NaN  0.359819       NaN
E  0.835537  0.766352       NaN       NaN

In [25]:
df['W']>0

A    False
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [26]:
df[['W', 'Y']]>0

       W      Y
A  False   True
B   True  False
C  False   True
D  False   True
E   True  False

In [27]:
df.to_csv('example',index=False)

In [28]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet2')

# Missing Data

In [29]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [30]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [31]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [32]:
df.dropna(thresh =2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [33]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [34]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category.

In [35]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [37]:
df['col2'].nunique()

3

In [38]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [40]:
def times2(x):
    return 2*x

In [41]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [42]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [43]:
df['col1'].sum()

10

In [44]:
del df['col1']

In [45]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [46]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [47]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [48]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [49]:
df.sort_values(by = 'col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Find Null Values or Check for Null Values**

In [50]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col2    4 non-null      int64
 1   col3    4 non-null      object
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [52]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [60]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [62]:
df.groupby('Company')

In [63]:
by_comp = df.groupby('Company')

In [65]:
by_comp['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [66]:
by_comp['Sales'].std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [67]:
by_comp['Sales'].min()

Company
FB      243
GOOG    120
MSFT    124
Name: Sales, dtype: int64

In [68]:
by_comp['Sales'].max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [69]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [70]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0